#### 🏗️ Terraform Plan Results

**Status**: success
**Triggered by**: @ALIBCJH

<details><summary>📋 View Full Terraform Plan</summary>

```terraform
Acquiring state lock. This may take a few moments...
tls_private_key.main_key: Refreshing state... [id=2d8f7c5c55450f9b825ea083a9af793fd5b1254d]
data.http.my_ip: Reading...
local_file.ssh_key_file: Refreshing state... [id=65f3011158f39d845a84b976f527ce12cbd0f205]
data.http.my_ip: Read complete after 0s [id=http://ipv4.icanhazip.com]
aws_key_pair.generated_key: Refreshing state... [id=juma-stockholm-key-v3]
aws_iam_role.ec2_ssm_role: Refreshing state... [id=juma-ec2-ssm-role-v3]
aws_vpc.main: Refreshing state... [id=vpc-00e625115ffb350da]
aws_dynamodb_table.terraform_locks: Refreshing state... [id=terraform-state-locking]
aws_s3_bucket.terraform_state: Refreshing state... [id=juma-terraform-state-storage-2026]
aws_iam_role_policy_attachment.ssm_policy: Refreshing state... [id=juma-ec2-ssm-role-v3/arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore]
aws_iam_instance_profile.ssm_profile: Refreshing state... [id=juma-ssm-instance-profile-v3]
aws_internet_gateway.gw: Refreshing state... [id=igw-05f56452c207d7bad]
aws_subnet.public_b: Refreshing state... [id=subnet-0d479c34819a25d84]
aws_subnet.public: Refreshing state... [id=subnet-06a1c1aec7431ba90]
aws_security_group.allow_ssh_pg: Refreshing state... [id=sg-014d75b5d0ce2dc51]
aws_route_table.public_rt: Refreshing state... [id=rtb-04f9b1b3768cc2dd5]
aws_db_subnet_group.db_subnets: Refreshing state... [id=juma-db-subnet-group-v3]
aws_security_group.rds_sg: Refreshing state... [id=sg-02f6b0c221deca54d]
aws_instance.web: Refreshing state... [id=i-01d42291903473d0f]
aws_route_table_association.b: Refreshing state... [id=rtbassoc-0175c51a658f9cf31]
aws_route_table_association.a: Refreshing state... [id=rtbassoc-0f8c5ee241d8dac8c]
aws_s3_bucket_versioning.enabled: Refreshing state... [id=juma-terraform-state-storage-2026]
aws_db_instance.postgres: Refreshing state... [id=db-ADBLNVSK2XNOGW4MDOET2I6Y4I]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_db_instance.postgres will be updated in-place
  ~ resource "aws_db_instance" "postgres" {
        id                                    = "db-ADBLNVSK2XNOGW4MDOET2I6Y4I"
      - password                              = (sensitive value) -> null
        tags                                  = {}
        # (57 unchanged attributes hidden)
    }

  # local_file.ssh_key_file will be created
  + resource "local_file" "ssh_key_file" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0400"
      + filename             = "juma-key.pem"
      + id                   = (known after apply)
    }

  # tls_private_key.main_key will be updated in-place
  ~ resource "tls_private_key" "main_key" {
        id                            = "2d8f7c5c55450f9b825ea083a9af793fd5b1254d"
        # (10 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

---
💡 **Next Steps**: 
- Review the plan above
- If changes look good, approve and merge this PR
- Merging to `main` will automatically apply these changes

*Workflow run: [74](https://github.com/ALIBCJH/Digital-Transformation/actions/runs/22685962564)*